cmsis-svd/cmsis-svd/data/Freescale/MKW30Z4.svd
        <register>
          <name>BBF_RES_TUNE_VAL_7_0</name>
          <description>BBF Resistor Tune Values 7..0</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_RES_TUNE_VAL_0</name>
              <description>BBF Resistor Tune Step 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_VAL_1</name>
              <description>BBF Resistor Tune Step 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_VAL_2</name>
              <description>BBF Resistor Tune Step 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_VAL_3</name>
              <description>BBF Resistor Tune Step 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_VAL_4</name>
              <description>BBF Resistor Tune Step 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_VAL_5</name>
              <description>BBF Resistor Tune Step 5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_VAL_6</name>
              <description>BBF Resistor Tune Step 6</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_VAL_7</name>
              <description>BBF Resistor Tune Step 7</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BBF_RES_TUNE_VAL_10_8</name>
          <description>BBF Resistor Tune Values 10..8</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_RES_TUNE_VAL_8</name>
              <description>BBF Resistor Tune Step 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_VAL_9</name>
              <description>BBF Resistor Tune Step 9</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_VAL_10</name>
              <description>BBF Resistor Tune Step 10</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCA_AGC_LIN_VAL_2_0</name>
          <description>TCA AGC Linear Gain Values 2..0</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCA_AGC_LIN_VAL_0</name>
              <description>LNM linear gain value for index 0, e.g. nominal value is 10^(-3/20). Stored with 2 fractional bits, e.g. round([10^(-3/20)]*2^2) = 3decimal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCA_AGC_LIN_VAL_1</name>
              <description>TCA AGC Linear Gain Step 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCA_AGC_LIN_VAL_2</name>
              <description>TCA AGC Linear Gain Step 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCA_AGC_LIN_VAL_5_3</name>
          <description>TCA AGC Linear Gain Values 5..3</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCA_AGC_LIN_VAL_3</name>
              <description>TCA AGC Linear Gain Step 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCA_AGC_LIN_VAL_4</name>
              <description>TCA AGC Linear Gain Step 4</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCA_AGC_LIN_VAL_5</name>
              <description>TCA AGC Linear Gain Step 5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCA_AGC_LIN_VAL_8_6</name>
          <description>TCA AGC Linear Gain Values 8..6</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCA_AGC_LIN_VAL_6</name>
              <description>TCA AGC Linear Gain Step 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCA_AGC_LIN_VAL_7</name>
              <description>TCA AGC Linear Gain Step 7</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCA_AGC_LIN_VAL_8</name>
              <description>TCA AGC Linear Gain Step 8</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BBF_RES_TUNE_LIN_VAL_3_0</name>
          <description>BBF Resistor Tune Values 3..0</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_RES_TUNE_LIN_VAL_0</name>
              <description>BBF Resistor Tune Linear Gain Step 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_LIN_VAL_1</name>
              <description>BBF Resistor Tune Linear Gain Step 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_LIN_VAL_2</name>
              <description>BBF Resistor Tune Linear Gain Step 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_LIN_VAL_3</name>
              <description>BBF Resistor Tune Linear Gain Step 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BBF_RES_TUNE_LIN_VAL_7_4</name>
          <description>BBF Resistor Tune Values 7..4</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_RES_TUNE_LIN_VAL_4</name>
              <description>BBF Resistor Tune Linear Gain Step 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_LIN_VAL_5</name>
              <description>BBF Resistor Tune Linear Gain Step 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_LIN_VAL_6</name>
              <description>BBF Resistor Tune Linear Gain Step 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_LIN_VAL_7</name>
              <description>BBF Resistor Tune Linear Gain Step 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BBF_RES_TUNE_LIN_VAL_10_8</name>
          <description>BBF Resistor Tune Values 10..8</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_RES_TUNE_LIN_VAL_8</name>
              <description>BBF Resistor Tune Linear Gain Step 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_LIN_VAL_9</name>
              <description>BBF Resistor Tune Linear Gain Step 9</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_RES_TUNE_LIN_VAL_10</name>
              <description>BBF Resistor Tune Linear Gain Step 10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_GAIN_TBL_03_00</name>
          <description>AGC Gain Tables Step 03..00</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_GAIN_00</name>
              <description>BBF Gain 00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_00</name>
              <description>LNM Gain 00</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_01</name>
              <description>BBF Gain 01</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_01</name>
              <description>LNM Gain 01</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_02</name>
              <description>BBF Gain 02</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_02</name>
              <description>LNM Gain 02</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_03</name>
              <description>BBF Gain 03</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_03</name>
              <description>LNM Gain 03</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_GAIN_TBL_07_04</name>
          <description>AGC Gain Tables Step 07..04</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_GAIN_04</name>
              <description>BBF Gain 04</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_04</name>
              <description>LNM Gain 04</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_05</name>
              <description>BBF Gain 05</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_05</name>
              <description>LNM Gain 05</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_06</name>
              <description>BBF Gain 06</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_06</name>
              <description>LNM Gain 06</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_07</name>
              <description>BBF Gain 07</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_07</name>
              <description>LNM Gain 07</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_GAIN_TBL_11_08</name>
          <description>AGC Gain Tables Step 11..08</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_GAIN_08</name>
              <description>BBF Gain 08</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_08</name>
              <description>LNM Gain 08</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_09</name>
              <description>BBF Gain 09</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_09</name>
              <description>LNM Gain 09</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_10</name>
              <description>BBF Gain 10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_10</name>
              <description>LNM Gain 10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_11</name>
              <description>BBF Gain 11</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_11</name>
              <description>LNM Gain 11</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_GAIN_TBL_15_12</name>
          <description>AGC Gain Tables Step 15..12</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_GAIN_12</name>
              <description>BBF Gain 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_12</name>
              <description>LNM Gain 12</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_13</name>
              <description>BBF Gain 13</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_13</name>
              <description>LNM Gain 13</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_14</name>
              <description>BBF Gain 14</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_14</name>
              <description>LNM Gain 14</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_15</name>
              <description>BBF Gain 15</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_15</name>
              <description>LNM Gain 15</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_GAIN_TBL_19_16</name>
          <description>AGC Gain Tables Step 19..16</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBF_GAIN_16</name>
              <description>BBF Gain 16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_16</name>
              <description>LNM Gain 16</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_17</name>
              <description>BBF Gain 17</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_17</name>
              <description>LNM Gain 17</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_18</name>
              <description>BBF Gain 18</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_18</name>
              <description>LNM Gain 18</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBF_GAIN_19</name>
              <description>BBF Gain 193</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNM_GAIN_19</name>
              <description>LNM Gain 19</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
