cmsis-svd/cmsis-svd/data/Freescale/MKW30Z4.svd
        <register>
          <name>TSM_OVRD3</name>
          <description>TSM Override 3</description>
          <addressOffset>0x2D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_SPARE0_EN_OVRD_EN</name>
              <description>Override control for TSM_SPARE0_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TSM_SPARE0_EN_OVRD to override the signal &quot;tsm_spare0_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_SPARE0_EN_OVRD</name>
              <description>Override value for TSM_SPARE0_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE1_EN_OVRD_EN</name>
              <description>Override control for TSM_SPARE1_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TSM_SPARE1_EN_OVRD to override the signal &quot;tsm_spare1_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_SPARE1_EN_OVRD</name>
              <description>Override value for TSM_SPARE1_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE2_EN_OVRD_EN</name>
              <description>Override control for TSM_SPARE2_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TSM_SPARE2_EN_OVRD to override the signal &quot;tsm_spare2_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_SPARE2_EN_OVRD</name>
              <description>Override value for TSM_SPARE2_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE3_EN_OVRD_EN</name>
              <description>Override control for TSM_SPARE3_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TSM_SPARE3_EN_OVRD to override the signal &quot;tsm_spare3_en&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_SPARE3_EN_OVRD</name>
              <description>Override value for TSM_SPARE3_EN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_MODE_OVRD_EN</name>
              <description>Override control for TX_MODE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of TX_MODE_OVRD to override the signal &quot;tx_mode&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_MODE_OVRD</name>
              <description>Override value for TX_MODE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MODE_OVRD_EN</name>
              <description>Override control for RX_MODE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Use the state of RX_MODE_OVRD to override the signal &quot;rx_mode&quot;.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_MODE_OVRD</name>
              <description>Override value for RX_MODE</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_POWER</name>
          <description>PA Power</description>
          <addressOffset>0x2D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PA_POWER</name>
              <description>PA Power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_BIAS_TBL0</name>
          <description>PA Bias Table 0</description>
          <addressOffset>0x2DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PA_BIAS0</name>
              <description>PA_BIAS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_BIAS1</name>
              <description>PA_BIAS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_BIAS2</name>
              <description>PA_BIAS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_BIAS3</name>
              <description>PA_BIAS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_BIAS_TBL1</name>
          <description>PA Bias Table 1</description>
          <addressOffset>0x2E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PA_BIAS4</name>
              <description>PA_BIAS4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_BIAS5</name>
              <description>PA_BIAS5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_BIAS6</name>
              <description>PA_BIAS6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_BIAS7</name>
              <description>PA_BIAS7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECYCLE_COUNT</name>
          <description>Recycle Count Register</description>
          <addressOffset>0x2E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x826</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECYCLE_COUNT0</name>
              <description>TSM RX Recycle Count 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECYCLE_COUNT1</name>
              <description>TSM RX Recycle Count 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING00</name>
          <description>TSM_TIMING00</description>
          <addressOffset>0x2E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x65006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_REG_EN_TX_HI</name>
              <description>Assertion time setting for PLL_REG_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REG_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_REG_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REG_EN_RX_HI</name>
              <description>Assertion time setting for PLL_REG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REG_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_REG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING01</name>
          <description>TSM_TIMING01</description>
          <addressOffset>0x2EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x65006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_VCO_REG_EN_TX_HI</name>
              <description>Assertion time setting for PLL_VCO_REG_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_REG_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_VCO_REG_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_REG_EN_RX_HI</name>
              <description>Assertion time setting for PLL_VCO_REG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_REG_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_VCO_REG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING02</name>
          <description>TSM_TIMING02</description>
          <addressOffset>0x2F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x65006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QGEN_REG_EN_TX_HI</name>
              <description>Assertion time setting for QGEN_REG_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QGEN_REG_EN_TX_LO</name>
              <description>Deassertion time setting for QGEN_REG_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QGEN_REG_EN_RX_HI</name>
              <description>Assertion time setting for QGEN_REG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QGEN_REG_EN_RX_LO</name>
              <description>Deassertion time setting for QGEN_REG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING03</name>
          <description>TSM_TIMING03</description>
          <addressOffset>0x2F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x65006A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCA_TX_REG_EN_TX_HI</name>
              <description>Assertion time setting for TCA_TX_REG_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCA_TX_REG_EN_TX_LO</name>
              <description>Deassertion time setting for TCA_TX_REG_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCA_TX_REG_EN_RX_HI</name>
              <description>Assertion time setting for TCA_TX_REG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCA_TX_REG_EN_RX_LO</name>
              <description>Deassertion time setting for TCA_TX_REG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING04</name>
          <description>TSM_TIMING04</description>
          <addressOffset>0x2F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6500FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_REG_EN_RX_HI</name>
              <description>Assertion time setting for ADC_REG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_REG_EN_RX_LO</name>
              <description>Deassertion time setting for ADC_REG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING05</name>
          <description>TSM_TIMING05</description>
          <addressOffset>0x2FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x650B6A3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_REF_CLK_EN_TX_HI</name>
              <description>Assertion time setting for PLL_REF_CLK_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REF_CLK_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_REF_CLK_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REF_CLK_EN_RX_HI</name>
              <description>Assertion time setting for PLL_REF_CLK_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REF_CLK_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_REF_CLK_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING06</name>
          <description>TSM_TIMING06</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x651AFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_CLK_EN_RX_HI</name>
              <description>Assertion time setting for ADC_CLK_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_CLK_EN_RX_LO</name>
              <description>Deassertion time setting for ADC_CLK_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING07</name>
          <description>TSM_TIMING07</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A004E00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_VCO_AUTOTUNE_EN_TX_HI</name>
              <description>Assertion time setting for PLL_VCO_AUTOTUNE_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_AUTOTUNE_EN_TX_LO</name>
              <description>Deassertion time setting for PLL_VCO_AUTOTUNE_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_AUTOTUNE_EN_RX_HI</name>
              <description>Assertion time setting for PLL_VCO_AUTOTUNE_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_AUTOTUNE_EN_RX_LO</name>
              <description>Deassertion time setting for PLL_VCO_AUTOTUNE_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
