cmsis-svd/cmsis-svd/data/Freescale/MKW30Z4.svd
        <register>
          <name>TSM_TIMING28</name>
          <description>TSM_TIMING28</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6562FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_DIG_EN_RX_HI</name>
              <description>Assertion time setting for RX_DIG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DIG_EN_RX_LO</name>
              <description>Deassertion time setting for RX_DIG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING29</name>
          <description>TSM_TIMING29</description>
          <addressOffset>0x35C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6362FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_INIT_RX_HI</name>
              <description>Assertion time setting for RX_INIT signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_INIT_RX_LO</name>
              <description>Deassertion time setting for RX_INIT signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING30</name>
          <description>TSM_TIMING30</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x65106A44</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIGMA_DELTA_EN_TX_HI</name>
              <description>Assertion time setting for SIGMA_DELTA_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGMA_DELTA_EN_TX_LO</name>
              <description>Deassertion time setting for SIGMA_DELTA_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGMA_DELTA_EN_RX_HI</name>
              <description>Assertion time setting for SIGMA_DELTA_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGMA_DELTA_EN_RX_LO</name>
              <description>Deassertion time setting for SIGMA_DELTA_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING31</name>
          <description>TSM_TIMING31</description>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6562FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZBDEM_RX_EN_RX_HI</name>
              <description>Assertion time setting for ZBDEM_RX_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZBDEM_RX_EN_RX_LO</name>
              <description>Deassertion time setting for ZBDEM_RX_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING32</name>
          <description>TSM_TIMING32</description>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6526FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_EN_RX_HI</name>
              <description>Assertion time setting for DCOC_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_EN_RX_LO</name>
              <description>Deassertion time setting for DCOC_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING33</name>
          <description>TSM_TIMING33</description>
          <addressOffset>0x36C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2726FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_INIT_RX_HI</name>
              <description>Assertion time setting for DCOC_INIT signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_INIT_RX_LO</name>
              <description>Deassertion time setting for DCOC_INIT signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING34</name>
          <description>TSM_TIMING34</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x65336865</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREQ_TARG_LD_EN_TX_HI</name>
              <description>Assertion time setting for FREQ_TARG_LD_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ_TARG_LD_EN_TX_LO</name>
              <description>Deassertion time setting for FREQ_TARG_LD_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ_TARG_LD_EN_RX_HI</name>
              <description>Assertion time setting for FREQ_TARG_LD_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ_TARG_LD_EN_RX_LO</name>
              <description>Deassertion time setting for FREQ_TARG_LD_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING35</name>
          <description>TSM_TIMING35</description>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAR_ADC_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for SAR_ADC_TRIG_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_ADC_TRIG_EN_TX_LO</name>
              <description>Deassertion time setting for SAR_ADC_TRIG_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_ADC_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for SAR_ADC_TRIG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_ADC_TRIG_EN_RX_LO</name>
              <description>Deassertion time setting for SAR_ADC_TRIG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING36</name>
          <description>TSM_TIMING36</description>
          <addressOffset>0x378</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_SPARE0_EN_TX_HI</name>
              <description>Assertion time setting for TSM_SPARE0_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE0_EN_TX_LO</name>
              <description>Deassertion time setting for TSM_SPARE0_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE0_EN_RX_HI</name>
              <description>Assertion time setting for TSM_SPARE0_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE0_EN_RX_LO</name>
              <description>Deassertion time setting for TSM_SPARE0_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING37</name>
          <description>TSM_TIMING37</description>
          <addressOffset>0x37C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_SPARE1_EN_TX_HI</name>
              <description>Assertion time setting for TSM_SPARE1_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE1_EN_TX_LO</name>
              <description>Deassertion time setting for TSM_SPARE1_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE1_EN_RX_HI</name>
              <description>Assertion time setting for TSM_SPARE1_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE1_EN_RX_LO</name>
              <description>Deassertion time setting for TSM_SPARE1_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING38</name>
          <description>TSM_TIMING38</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_SPARE2_EN_TX_HI</name>
              <description>Assertion time setting for TSM_SPARE2_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE2_EN_TX_LO</name>
              <description>Deassertion time setting for TSM_SPARE2_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE2_EN_RX_HI</name>
              <description>Assertion time setting for TSM_SPARE2_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE2_EN_RX_LO</name>
              <description>Deassertion time setting for TSM_SPARE2_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING39</name>
          <description>TSM_TIMING39</description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_SPARE3_EN_TX_HI</name>
              <description>Assertion time setting for TSM_SPARE3_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE3_EN_TX_LO</name>
              <description>Deassertion time setting for TSM_SPARE3_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE3_EN_RX_HI</name>
              <description>Assertion time setting for TSM_SPARE3_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE3_EN_RX_LO</name>
              <description>Deassertion time setting for TSM_SPARE3_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING40</name>
          <description>TSM_TIMING40</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO0_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO0_TRIG_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO0_TRIG_EN_TX_LO</name>
              <description>Deassertion time setting for GPIO0_TRIG_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO0_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO0_TRIG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO0_TRIG_EN_RX_LO</name>
              <description>Deassertion time setting for GPIO0_TRIG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING41</name>
          <description>TSM_TIMING41</description>
          <addressOffset>0x38C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO1_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO1_TRIG_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1_TRIG_EN_TX_LO</name>
              <description>Deassertion time setting for GPIO1_TRIG_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO1_TRIG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1_TRIG_EN_RX_LO</name>
              <description>Deassertion time setting for GPIO1_TRIG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING42</name>
          <description>TSM_TIMING42</description>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO2_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO2_TRIG_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO2_TRIG_EN_TX_LO</name>
              <description>Deassertion time setting for GPIO2_TRIG_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO2_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO2_TRIG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO2_TRIG_EN_RX_LO</name>
              <description>Deassertion time setting for GPIO2_TRIG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSM_TIMING43</name>
          <description>TSM_TIMING43</description>
          <addressOffset>0x394</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO3_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO3_TRIG_EN TX sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO3_TRIG_EN_TX_LO</name>
              <description>Deassertion time setting for GPIO3_TRIG_EN signal or group TX sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO3_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO3_TRIG_EN signal or group RX sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO3_TRIG_EN_RX_LO</name>
              <description>Deassertion time setting for GPIO3_TRIG_EN signal or group RX sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
