cmsis-svd/cmsis-svd/data/Freescale/MKW30Z4.svd
        <register>
          <name>XTAL_CTRL2</name>
          <description>Crystal Oscillator Control Register 2</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTAL_REG_SUPPLY</name>
              <description>XTAL_REG_SUPPLY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1.2V</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1.05V</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1.075V</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>1.1V</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>1.125V</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>1.15V</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>1.175V</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>1.2V</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>1.225V</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>1.25V</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>1.325V</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>1.35V</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>1.375V</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>1.4V</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_REG_BYPASS_ON</name>
              <description>XTAL_REG_BYPASS_ON</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_REG_ON_OVRD_ON</name>
              <description>XTAL_REG_ON_OVRD_ON</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_REG_ON_OVRD</name>
              <description>XTAL_REG_ON_OVRD</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_ON_OVRD_ON</name>
              <description>XTAL_ON_OVRD_ON</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_ON_OVRD</name>
              <description>XTAL_ON_OVRD</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_DIG_CLK_OUT_ON</name>
              <description>XTAL_DIG_CLK_OUT_ON</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_REG_ATST_SEL</name>
              <description>XTAL_REG_ATST_SEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_ATST_SEL</name>
              <description>XTAL_ATST_SEL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_ATST_ON</name>
              <description>XTAL_ATST_ON</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL_SPARE</name>
              <description>XTAL_SPARE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BGAP_CTRL</name>
          <description>Bandgap Control</description>
          <addressOffset>0x43C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x87</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BGAP_CURRENT_TRIM</name>
              <description>BGAP_CURRENT_TRIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGAP_VOLTAGE_TRIM</name>
              <description>BGAP_VOLTAGE_TRIM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGAP_ATST_SEL</name>
              <description>BGAP_ATST_SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGAP_ATST_ON</name>
              <description>BGAP_ATST_ON</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_CTRL</name>
          <description>PLL Control Register</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x23</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_VCO_BIAS</name>
              <description>PLL VCO Bias Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LFILT_CNTL</name>
              <description>PLL Loop Filter Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REG_SUPPLY</name>
              <description>PLL_REG_SUPPLY</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1.2V</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1.05V</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1.075V</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>1.1V</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>1.125V</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>1.15V</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>1.175V</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>1.2V</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>1.225V</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>1.25V</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>1.325V</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>1.35V</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>1.375V</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>1.4V</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_REG_BYPASS_ON</name>
              <description>PLL_REG_BYPASS_ON</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_LDO_BYPASS</name>
              <description>PLL_VCO_LDO_BYPASS</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_BIAS</name>
              <description>HPM Array Bias</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_SPARE7</name>
              <description>PLL_VCO_SPARE7</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_CTRL2</name>
          <description>PLL Control Register 2</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_VCO_KV</name>
              <description>PLL_VCO_KV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_KMOD_SLOPE</name>
              <description>PLL_KMOD_SLOPE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_REG_SUPPLY</name>
              <description>PLL_VCO_REG_SUPPLY</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1.15V</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1.2V</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1.25V</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>1.3V</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_TMUX_ON</name>
              <description>PLL_TMUX_ON</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_TEST_CTRL</name>
          <description>PLL Test Control</description>
          <addressOffset>0x44C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_TMUX_SEL</name>
              <description>PLL_TMUX_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_REG_ATST</name>
              <description>PLL_VCO_REG_ATST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REG_ATST_SEL</name>
              <description>PLL_REG_ATST_SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_VCO_TEST_CLK_MODE</name>
              <description>PLL_VCO_TEST_CLK_MODE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_FORCE_VTUNE_EXTERNALLY</name>
              <description>PLL_FORCE_VTUNE_EXTERNALLY</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_RIPPLE_COUNTER_TEST_MODE</name>
              <description>PLL_RIPPLE_COUNTER_TEST_MODE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QGEN_CTRL</name>
          <description>QGEN Control</description>
          <addressOffset>0x458</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QGEN_REG_SUPPLY</name>
              <description>QGEN_REG_SUPPLY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1.2V</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1.05V</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>1.075V</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>1.1V</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>1.125V</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>1.15V</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>1.175V</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>1.2V</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>1.225V</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>1.25V</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>1.325V</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>1.35V</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>1.375V</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>1.4V</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QGEN_REG_ATST_SEL</name>
              <description>QGEN_REG_ATST_SEL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QGEN_REG_BYPASS_ON</name>
              <description>QGEN_REG_BYPASS_ON</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
